[{"articleLink":"https://thebiglead.com/2019/06/17/toronto-raptors-parade-shooting/","title":"Shots Reportedly Fired At Toronto Raptors NBA Championship Parade","content":"There are reports of shots fired at the Toronto Raptors victory parade on Monday. While this is a developing situation we’ll try to keep you updated with the latest information.\n\nThe parade was in Nathan Phillips square when multiple people reported hearing gunshots in the middle of the Raptors players giving speeches.\n\nHere is the latest from the scene:","author":"Ryan Phillips","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/ryan-phillips/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/raptors-victory-parade.png","imgName":"raptors-victory-parade"},{"articleLink":"https://thebiglead.com/2019/06/17/sydney-sweeney-houston-rockets-lavar-ball-lonzo-trade/","title":"PM Roundup: Sydney Sweeney; Houston Rockets May Be Imploding; LaVar Ball Says He Wanted Lonzo Traded","content":"The Big Lead’s PM Sports Roundup, which is just so stoked LaVar Ball is talking again, aren’t you guys?\n\nSydney’s new show debuts: Sydney Sweeney’s new show “Euphoria” debuted on HBO Sunday night. The 21-year-old actress has previously had pivotal roles on “The Handmaid’s Tale” and “Sharp Objects.” She seems primed for a big-time breakout.\n\nRockets are falling apart: The Houston Rockets may be coming apart at the seams. There’s a lot of turmoil surrounding the team and everyone seems to believe it’s about to all come crashing down.\n\nLaVar is talking again: LaVar Ball claims he always wanted the Lakers to trade his son Lonzo Ball. Sure.\n\nTweet of the Day:\n\nIn Case You Missed It on The Big Lead:\n\nLaVar Ball Made an Inappropriate Comment to Molly Qerim\n\n2009 NBA Re-Draft: The Clippers Land Curry, Grizzlies Have a New Big Three\n\nColin Cowherd Delaying Vacation So He Can Fire Off Lakers Takes\n\nMichelle Beadle Indicates She Will Be on ESPN NBA Countdown Next Season\n\nAround the Sports Internet:\n\nLaMelo Ball signed to play pro ball in Australia\n\nNoah Syndergaard is headed to the IL\n\nAn early look at the National League award races\n\nEight potential NBA draft-related trades\n\nSong of the Day:","author":"Ryan Phillips","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/ryan-phillips/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/sydney-sweeney-1-e1560800640708.jpg","imgName":"sydney-sweeney-1-e1560800640708"},{"articleLink":"https://thebiglead.com/2019/06/17/reddit-bans-r-nbastreams/","title":"Reddit Bans Popular \"r/nbastreams\" Page","content":"All good things must come to an end, and this happened to be the case today for the popular Reddit page, “r/nbastreams.”\n\nThe page was a go-to option for many Reddit users, who would access links leading to live streams of NBA games completely for free. Although completely illegal, the streaming of copyrighted content, as opposed to downloaded content, makes it more difficult to track down the individuals responsible for producing the stream. Even though these links are posted on Reddit, the links are not directly associated with Reddit, making their direct responsibility for any violations questionable.\n\nWith the NBA Finals having recently concluded, the banning of the r/nbastreams page comes at an interesting time. While Reddit has long been an advocate for free speech, it hasn’t stopped them from shutting down streaming pages before. The fact that that the widely popular r/nflstreams and r/mlbstreams pages are still active is worth noting as well.\n\nThe demise of r/nbastreams prompted a bevy of hilarious yet devastating reactions on social media from loyal users.\n\nIf you were an active user of r/nbastream, we’re sorry for your loss. But with the whack-a-mole nature of situations like these, a new way to stream live NBA games for free is likely on the horizon.\n\nToday may be a win for NBA League Pass, but one thing’s for certain: the people won’t give up on finding ways to live stream games for free.","author":"Kevin Gamgort","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/kgamgort/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/gettyimages-3040876.jpg","imgName":"gettyimages-3040876"},{"articleLink":"https://thebiglead.com/2019/06/17/albert-breer-trophy-twitter/","title":"What Did We Learn From Albert Breer's Participation Trophy Stunt?","content":"Sports Illustrated’s Albert Breer informed the world that he had broken his kid’s participation trophy out of some sort of duty.\n\nPeople reacted as if this was a thing that happened because Breer said it happened. Turns out, the joke is on all of those people because that’s not what happened, Breer seemed — seemed — to reveal only after retweeting a score of angry comments from people who thought it was real.\n\nSike!\n\nAlthough, stay tuned, there could be another twist coming. There are many layers to this performance.\n\nWhat can we learn from the social experiment?\n\nWell, for one, people will quite rightly point out that those who would destroy their children’s trophies are a bit misguided. It hardly seems controversial to say that when presented with the choice of destroying objects that exist to give kids self-worth or leave them intact, there’s an easy choice.\n\nIf you really have a problem with participation trophies, there are probably better ways to grapple with it than smashing Little Johnny’s property. You know, like explaining the difference between earned prizes and those given to everyone, using words and reason instead of brute force.\n\nBreer’s okie doke worked particularly well because he seems a likely candidate to do something like this and possesses a personal brand that often questions why people get offended. Had Adam Schefter done something similar, people wouldn’t have fallen for it. Danny Kanell? Maybe.\n\nSo, yeah, there’s no need to get worked up by any of this, or attack Breer. But I still don’t know what we’re supposed to take from this, other than when you do something particularly triggering, people will get triggered.\n\nNow, if you’ll excuse me, I’m off to smash all anything pink in my son’s room so he doesn’t get soft. Can’t have it.\n\nJust kidding.\n\nIn all seriousness, the best participation trophy take appeared on this very website. Kids are perceptive and smart and unmotivated by relatively cheap baubles. Let’s start giving them credit for knowing that there are winners and losers, that a dumb plastic trophy doesn’t supersede what happened on the field, and isn’t a motivating factor in why they play.","author":"Kyle Koster","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/koster/","imgLink":"https://usatthebiglead.files.wordpress.com/2015/10/the-presidents-cup-trophy.jpg","imgName":"the-presidents-cup-trophy"},{"articleLink":"https://thebiglead.com/2019/06/17/10-most-ridiculous-championship-parade-moments-in-sports-history/","title":"10 Most Ridiculous Championship Parade Moments in Sports History","content":"On Monday, the Toronto Raptors celebrate their first NBA title in franchise history with a parade around The Six. Championship parades are one of the most enjoyable experiences in all of sports. They provide a great opportunity for athletes and fans to come together and honor a momentous occasion as one. It’s also a huge party that’s bolstered some ridiculous yet memorable moments over the years.\n\nWith this in mind, let’s take a look at some of these moments.\n\nReal Madrid Trophy Casualty\n\nAfter defeating arch-nemesis Barcelona in the Copa del Rey final, Real Madrid celebrated with thousands of fans in the Nation’s capital. All was going well until Real Madrid defender Sergio Ramos dropped the Copa del Rey trophy from the top of the bus. To make matters worse, the bus driver did not see the fallen trophy and continued to creep forward, ultimately running over the trophy.\n\nRamos promptly became known as “The Trophy Killer,” in one of the funniest and unbelievable moments in championship parade history. The mangled 2011 Copa del Rey trophy has been on display at the Spanish Football Federation Museum in Las Rozas (Madrid) ever since.\n\nCavs Fan Eats Horse Poop\n\nWinning your first championship in franchise history and ending a city-wide 52-year championship drought warrants some wild behavior. With that in mind, there’s no explanation for what you’re about to see.\n\nVIEWER DISCRETION IS ADVISED.\n\nFans were so excited that they did not know how to contain themselves. Especially the fan in the video above, who was so amped up that he decided to eat horse poop on the streets of Cleveland, much to the disgust and amusement of the fans around him.\n\nAfter coming back from a 3-1 series deficit to defeat the Golden State Warriors, the Cleveland Cavaliers were finally on top of the world. Their long-awaited 2016 championship parade brought in over 1 million people, making it the then-largest championship celebration in NBA history.\n\nJR Smith Shirtless\n\nWhile one Cavs fan was eating poop off the streets, JR Smith was soaking up the 2016 Cavaliers championship parade by high-fiving fans and celebrating the moment without a shirt on.\n\nThis was just the start of a shirtless run for Smith, who was seen celebrating the championship at various locations in the coming weeks, all without a shirt on.\n\nNo shoes, no shirt, and he stills gets service. That’s the J.R. Smith experience for you.\n\nJason Kelce’s Hilarious Speech\n\nAll rise for Court Jester Kelce.\n\nAfter winning their first title in franchise history, Philadelphia Eagles offensive guard Jason Kelce honored the occasion unlike anyone before. Dawning a ridiculous court jester-style outfit, Kelce delivered a powerful speech to thousands of fans at the bottom steps of the iconic Philadelphia Art Museum. Kelce’s speech, or rant, called out all of the haters who doubted the members of the championship-winning Eagles.\n\nAlthough many aspects of Kelce’s speech and the demeanor in which he presented it were ridiculous, he provided a quote for the ages.\n\n“An underdog is a hungry dog!”\n\nMark Madsen’s Awkward Dancing\n\nThe Los Angeles Lakers’ 2002 championship team might have been carried by Shaquille O'Neal and Kobe Bryant on the court, but off the court, it was Mike Madsen who captivated the audience.\n\nWith Shaq rapping in the background, Lakers’ bench player Mike Madsen provided one of the most awkward displays of dancing in the history of existence. What made it funnier was the plain outfit that Madsen was wearing, a championship white t-shirt and jeans. You do you, Mike.\n\nJordan Bell Drinks a Fan’s Hennessey\n\nAfter winning a title in his rookie season, Warriors’ forward Jordan Bell was having the time of his life during the 2018 Championship parade. While honoring JR Smith with the no shirt look and holding a bottle of empty Hennessey, he got off the bus and went into the crowd to take a swig from another fan’s bottle.\n\nIt was yet another great fan-athlete interaction, which is what championship parades are all about.\n\nGronkowski Goes Wild\n\nIt’s not a party until Rob Gronkowski arrives. Known for being the life of the party and complete goofball, Gronkowski enjoyed his final championship parade as a member of the Patriots by going wild.\n\nGronk was slugging beers and dancing shirtless with his teammates, much to the amusement of the fans around him. This was not the first time Gronk enjoyed such shenanigans at a Patriots parade, but it was the last. An entertainer both on and off the field, he’s truly one of a kind.\n\nChase Utley’s Expletive-Filled Speech\n\nThe Philadelphia Phillies’ star second baseman couldn’t contain his excitement during their 2008 Championship Parade. It had been the Phillies’ first title since 1980, which also marked the most recent time a Philadelphia professional sports team won a championship up until that point. Snapping an almost 30-year city-wide title drought, Utley started off his speech with a nice expletive.\n\nThe response: a standing ovation from the Phillies’ faithful. Naturally.\n\nDirk Sings “We Are the Champions”\n\nAfter upsetting the Miami Heat’s Big Three in the 2011 NBA Finals, the Dallas Mavericks celebrated their first NBA title in franchise history. With thousands of fans in attendance, beloved star Dirk Nowitzki ended his brief speech by leading the crowd into singing the legendary Queen song, “We Are the Champions.”\n\nIt was the signature moment of their championship parade, and only fitting that it came from the best and most beloved player in franchise history.\n\nTroy Polamalu Goes (Crowd) Surfing\n\nAfter defeating the Arizona Cardinals, 27-23, in the 2008 Super Bowl, the Pittsburgh Steelers hit the streets of the Steel City to celebrate with the fans. After high demand from the fans, Steelers safety Troy Polamalu dove into the fans for a signature crowd surf.\n\nIt’s pretty impressive that the fans weren’t intimidated by Polamalu jumping into them. Especially since he was one of the hardest hitting and powerful safeties the league has ever seen, at the height of his powers. But that’s Pittsburgh Tough for you.","author":"Kevin Gamgort","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/kgamgort/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/gettyimages-634157522.jpg","imgName":"gettyimages-634157522"},{"articleLink":"https://thebiglead.com/2019/06/17/shannon-sharpe-skip-bayless-goat-undisputed/","title":"Shannon Sharpe as a Goat is Exactly What Sports Debate TV Was Missing","content":"You never know what the debate shows will you bring you on a Monday morning. And some days we even get a pleasant surprise, like on this fantastic day. On Undisputed, noted LeBron James stan Shannon Sharpe showed up rocking a James jersey and dressed as, wait for it, a goat with shades.\n\nHave you ever seen a goat drop this level of takes? Because this snazzy one has the Lakers winning the chip next season:\n\nWhile some may find this a little much, this is exactly what was needed in the debate genre. People like Skip Bayless and Stephen A. Smith will wear the occasional jersey to troll, or even a cowboy hat, but have clearly underestimated the value – and look – of costume-wearing. Sharpe’s latest attire does raise the stakes for future getups, though. It could be a tad harder now to enjoy a feisty LeBron James debate with two human faces going at it now.\n\nBy the way, how great is it seeing an NFL Hall-of-Famer and a longtime sports writer betting cases of Mountain Dew over their debates?","author":"Bobby Burack","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/bobby-burack/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/screen-shot-2019-06-17-at-10.49.08-am.png","imgName":"screen-shot-2019-06-17-at-10.49.08-am"},{"articleLink":"https://thebiglead.com/2019/06/17/drake-raptors-parade-security-guards/","title":"Drake Attends Raptors Championship Parade With Nine Security Guards","content":"Drake has become nearly as notorious as a Toronto Raptors superfan than he is as a rapper. Nearly. In any case, Drake was obviously going to attend the team’s championship parade and hang out on the buses that will bring the team around the city, showing off the Larry O’Brien Trophy.\n\nOf course, at such an event and with his stature, Drake wasn’t going at it alone. In fact, he had no less than nine security guards surrounding him on his way up to the buses.\n\nThis is no shock, don’t get me wrong, but it is rather amusing to see security guards backing up security guards backing up security guards. Even in a city that loves him with all their heart, Drake is simply too famous for such an event.\n\nThe downfalls of fame. Then again, he’s on the bus with Kawhi Leonard, so it’s a trade-off most would make.","author":"Liam McKeone","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/liamjm304/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/drake.jpg","imgName":"drake"},{"articleLink":"https://thebiglead.com/2019/06/17/cowboys-cole-beasley-bills-offense/","title":"Cole Beasley and Dez Bryant Criticize Cowboys' Offense","content":"After signing a four-year, $29 million contract with the Buffalo Bills this offseason, it didn’t take long for wide receiver Cole Beasley to take a shot at his former team.\n\nIn a recent interview with The Athletic, Beasley took a shot at the Dallas Cowboys, saying that the wide receiver position is far more important in the Bills playbook than it was in Dallas.\n\nBeasley didn’t stop here and continued to further criticize the Cowboys offensive scheme, hinting at its simplicity.\n\n“I felt like it was easy for me to be taken away. Really, in that offense, all you had to do was bracket me because I went beyond 5 yards rarely. And when I did, it was from the same formation; I was in the same spot all the time.”\n\nWell, it appears that Beasley isn’t the only former Cowboy to have gripes with their offensive system. Former Cowboys star receiver Dez Bryant weighed in via Twitter, backing up Beasley’s claim as true.\n\nWhether or not Beasley and Bryant are telling the truth or are just salty about the way their careers ended in Dallas, this news is not surprising. With the addition of Ezekiel Elliot in 2016, the Cowboys became extremely run-heavy. When you have one of the best running backs in the entire NFL, it only makes sense that the importance of receivers diminishes.\n\nBeasley appears to be happy in his new home and is looking forward to focusing on football without the distractions he faced on “America’s Team.”\n\n“I’m just glad to be here,” Beasley said at One Bills Drive, “where it’s 100 percent about ball and not a show or a brand. It’s purer here. I’m proud to be part of something like that.”\n\nWith aging and injury-prone LeSean McCoy in the Buffalo backfield, Beasley should get plenty of opportunities this upcoming season.","author":"Kevin Gamgort","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/kgamgort/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/gettyimages-630768662.jpg","imgName":"gettyimages-630768662"},{"articleLink":"https://thebiglead.com/2019/06/17/fake-kawhi-leonard-at-raptors-parade-should-invest-in-some-lifts/","title":"Fake Kawhi Leonard at Raptors Parade Should Invest in Some Lifts","content":"A Kawhi Leonard impersonator has taken to the streets to sign autographs and take pictures with fans today during the Toronto Raptors’ championship parade. As an ignorant American, I have no idea if he’s charging money and refuse to look up if they have capitalism up in Canada. But he should.\n\nThe Board Man shouldn’t be the only one getting paid.\n\nThe guy does, in fact, look a lot like Leonard. Except for one thing. His height. No way is he cracking six-feet tall, or whatever that is in meters. Again, not looking it up.\n\nIt might be a good investment for our guy here to get some lifts. It just feels like all of these photos aren’t going to be very believable without some pretty significant optical illusions.\n\nHere’s hoping he has a great day and enjoys all his 15 minutes have to offer. Nothing like a title to bring people of all sizes and relative talent together.","author":"Kyle Koster","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/koster/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/gettyimages-1155816812.jpg","imgName":"gettyimages-1155816812"},{"articleLink":"https://thebiglead.com/2019/06/17/kawhi-leonard-will-apparently-consider-1-6-of-the-nba-as-a-free-agent/","title":"Kawhi Leonard Will Apparently Consider 1/6 of the NBA As a Free Agent","content":"Cris Carter sounds very sure that Kawhi Leonard has five teams on his radar as he enters free agency: The Raptors as the favorite and then in no particular order the four teams from Los Angeles and New York. He says very authoritatively that these teams will all be a part of the discussions. Add it all up and it’s 1/6th of the league!\n\nAs has been noted before, Carter’s agent when he was an NFL player was Mitch Frankel, who reps Kawhi now.\n\nCarter mentions the Raptors as the favorite for a number of obvious reasons: The moments from winning a championship, the fact that they can pay him the most money, and his strong rapport with their team doctors.\n\nIt’s pretty difficult to imagine Kawhi picking any team besides the Raptors or Clippers. The Lakers aren’t going to have room for another max deal after the Anthony Davis trade, and there’s just no way he’d want all the attention that would come from playing for them with LeBron.\n\nRegarding the Knicks and Nets, we’ve heard time and again that Kawhi has been jonesing to get back to the West Coast. Why would he leave Toronto, which as we’ve already said can pay him more money and he already knows is a great situation, for either of them?","author":"Ryan Glasspiegel","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/ryan-glasspiegel/","imgLink":null,"imgName":null},{"articleLink":"https://thebiglead.com/2019/06/17/auburn-overthrow-college-world-series/","title":"VIDEO: Auburn Once Again Learns Baseball Is a Very Cruel Game","content":"Auburn third baseman Edouard Julien has to be the sickest person in America this morning. The sophomore had a chance to secure a Tigers’ victory over Mississippi State in the College World Series. All he had to do was make a routine throw to first base for the final out in the bottom of the ninth. But he didn’t, instead sailing the toss over his first baseman’s head and opening the door to a Bulldogs’ win in extra innings.\n\nBaseball. A cruel game.\n\nBefore the inopportune error, Julien was poised to be the hero. He homered and had three RBI earlier in the game.\n\nAuburn is now on the brink of elimination. But they have set a precedent for overcoming a heartbreaking loss. Here’s the almost inexplicable way they exited the SEC Tournament.","author":"Kyle Koster","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/koster/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/screen-shot-2019-06-17-at-9.24.06-am.png","imgName":"screen-shot-2019-06-17-at-9.24.06-am"},{"articleLink":"https://thebiglead.com/2019/06/17/colin-cowherd-delaying-vacation-so-he-can-fire-off-lakers-takes/","title":"Colin Cowherd Delaying Vacation So He Can Fire Off Lakers Takes","content":"Colin Cowherd was supposed to be on vacation today. As a sports radio host, he’d planned it perfectly. The NBA Finals are done and the traditional drastic stop of interesting things happening in the stick-and-ball arena is poised to unfold. These are the thin days, folks. If you see a content creator this next month or so, give them a hug and tell them you’re thinking of them and their struggle.\n\nBut something interesting happened on the way to the doldrums. The Los Angeles Lakers decided to pull off a blockbuster trade with the New Orleans Pelicans in order to acquire Anthony Davis. Rumors swirl that Kyrie Irving could also be headed out West in order to put the band back together with LeBron James.\n\nIt’s a DEFCON 1 moment and Cowherd, arguably the Face of FS1 and certainly the Pied Piper of all things Lakers, has decided to step up to the plate.\n\nThat’s right, he’s calling an audible, delaying his time off, and headed into studio to rip off Davis-related commentary.\n\nHere’s hoping he’s declined to weigh in at all so he can attack the microphone like a dog that hasn’t eaten in days.\n\nSelfless stuff here. It goes to show there are certain things bigger than family. Like sports.","author":"Kyle Koster","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/koster/","imgLink":"https://usatthebiglead.files.wordpress.com/2016/05/usatsi_9090761.jpg","imgName":"usatsi_9090761"},{"articleLink":"https://thebiglead.com/2019/06/17/roundup-mtv-movie-tv-awards-red-carpet-fashion-massive-power-outage-in-south-america-nba-free-agency-landscape/","title":"Roundup: MTV Movie & TV Awards Red Carpet Fashion, Massive Power Outage in South America, NBA Free Agency Landscape","content":"Jennifer Anniston … MTV Movie & TV Awards red carpet slideshow … “Mom arrested after entering elementary school and confronting son’s alleged bullies” … Colorado surpasses $1 billion in tax revenue from marijuana sales … “Houston pastor who backed bill criminalizing abortion arrested for alleged child sex abuse” … Massive power outage hits all of Argentina and Uruguay … No games in the Matt LaFleur era yet, but Aaron Rodgers is already talking about wanting more freedom at line of scrimmage … A 27-year-old, who had an underlying medical condition, died at Bonnaroo … Caitlyn Jenner’s Father’s Day message appears to include a shot at Tristan Thompson … “Florida man thought he bought a villa for $9K in an online auction but it turned out to be a foot-wide strip of grass worth $50 – and officials are refusing to give him a refund”.\n\nRobert Klemko had a deep, dark profile of Kellen Winslow II\n\nAfter 1,000 racing greyhounds died or were killed last year, there are calls for the sport to be banned\n\nThe best landing spots for the top 10 NBA free agents after Anthony Davis trade\n\n“Hundreds of active-duty and retired law enforcement officers from across the United States are members of Confederate, anti-Islam, misogynistic or anti-government militia groups on Facebook, a Reveal investigation has found.”\n\nMovie sequels are slumping at the box office recently\n\nFriends women’s reunion for Courteney Cox’s 55th birthday party\n\nNASCAR race’s winning truck driver disqualified after truck fails inspection post race\n\nCharles Barkley’s thoughts on NBA Finals with Dan Patrick\n\nSka cover of Madonna’s Material Girl\n\nPenny pyramid with over a million pennies\n\n ","author":"Ryan Glasspiegel","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/ryan-glasspiegel/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/gettyimages-108923913-e1560734672945.jpg","imgName":"gettyimages-108923913-e1560734672945"},{"articleLink":"https://thebiglead.com/2019/06/17/nba-free-agency-start-cap-space-best-available/","title":"Everything You Need to Know About NBA Free Agency","content":"With the NBA Finals in the books, it’s now time to turn to NBA free agency, and the 2019 class is one full of hype and hope.\n\nNBA Finals MVP Kawhi Leonard may leave the Toronto Raptors right after leading the team to its first-ever NBA title and Kyrie Irving is expected to move to another team after a tumultuous season with the Boston Celtics.\n\nGolden State Warriors stars Kevin Durant and Klay Thompson are also available, despite the fact that neither may be available to play in the 2019-20 season due to injuries suffered in the NBA Finals.\n\nHere’s everything you need to know to get ready for this summer’s NBA free agency period:\n\nWhen Does NBA Free Agency Start?\nNBA Free Agency starts officially on June 30 at 6 p.m. ET, allowing players and teams to officially negotiate new contracts. However, no free agent can officially sign their potentially agreed deals until July 6th at noon because of the league’s required Moratorium period, a week in the beginning of free agency that allows both players and teams to fully think about their signing decisions. There are a few exceptions to the NBA”s Moratorium period to kick off free agency. As explained by NBA CBA FAQ: Teams may sign their first round draft picks. A second-round draft pick can accept a required tender, which is a one-year contract offer teams must submit to retain their rights to the player. A restricted free agent can accept a qualifying offer from his prior team. A restricted free agent finishing the fourth season of his rookie “scale” contract can accept a maximum qualifying offer. A restricted free agent may sign an offer sheet with a new team, although the 48-hour matching period does not begin until the conclusion of the Moratorium. Teams may sign players to minimum salary contracts for one or two seasons, with no bonuses of any kind. Teams may sign players to Two-Way contracts, convert a Two-Way contract to a standard NBA contract, or convert a standard NBA contract with an Exhibit 10 to a Two-Way contract Teams may waive players or claim players waived by other teams There’s no particular window of time for players to be signed. They can be signed at the beginning of free agency and through the season if they’re available.\nWhat is the difference between an unrestricted free agent and a restricted free agent?\nUFA – Unrestricted Free Agent – a player can sign with whoever they want as their old team no longer holds their rights RFA– Restricted Free Agent – a player can agree to an offer from another team, however, their previous team has 48 hours to match those terms, thus keeping the player Player option (PO): the player has the right to decide whether or not to stay with their current team for another year Team option (TO): the team has the right to keep a player for one more year\nWho are the best free agents available?\n(2018 team in parentheses, status follows)\n\nFor more, check out our list on the NBA’s Top 25 Free Agents this summer\n\nKawhi Leonard (Toronto Raptors, PO) Kyrie Irving (Boston Celtics, PO) Kevin Durant  (Golden State Warriors, PO) Klay Thompson (Golden State Warriors, UFA) Kemba Walker (Charlotte Hornets, UFA) DeMarcus Cousins (Golden State Warriors, UFA) Jimmy Butler (Philadelphia 76ers, PO) Kristaps Porzingis (Dallas Mavericks, RFA) Khris Middleton (Milwaukee Bucks, PO) D’Angelo Russell (Brooklyn Nets, RFA)\nWhich teams have the most cap space?\nNew York Knicks: $72.9 million Los Angeles Clippers: $59.7 million Brooklyn Nets: $54.6 million Dallas Mavericks: $52.2 million Atlanta Hawks: $50.6 million","author":"Jeff Weisinger","datePublished":"2019/06/17","authorLink":"https://thebiglead.com/author/jeffweisinger/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/gettyimages-1155813264.jpg","imgName":"gettyimages-1155813264"},{"articleLink":"https://thebiglead.com/2019/06/16/oj-simpson-khloe-kardashians-father-twitter-kris-jenner/","title":"O.J. Simpson Denies Being Khloe Kardashian's Father on Twitter","content":"O.J. Simpson has Twitter now because that’s a real thing that’s happening in 2019. He took time on Sunday — which happened to be Father’s Day — to deny sleeping with Kris Jenner and, in turn, being Khloe Kardashian’s father.\n\nFor years rumors had swirled that Simpson and Jenner had a relationship and that he was actually Khloe’s father. Well, he denies it. And, I mean, if you can’t trust O.J. Simpson, who can you trust?\n\nWatch:\n\nI kind of feel awful sharing anything from O.J. Simpson at this point. He’s an awful human being, and the fact that he joined Twitter 25 years after Nicole Brown Simpson was was murder shouldn’t be lost on anyone.\n\nSo yeah, this will be the last time I write about O.J. or his Twitter account unless something awful and fully deserved happens to him.","author":"Ryan Phillips","datePublished":"2019/06/16","authorLink":"https://thebiglead.com/author/ryan-phillips/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/o.j.-simpson.jpg","imgName":"o.j.-simpson"},{"articleLink":"https://thebiglead.com/2019/06/16/video-gary-woodland-wins-us-open-with-birdie-putt-on-18/","title":"Video: Gary Woodland Wins US Open With Birdie Putt on 18","content":"Gary Woodland is a terrific story — he won his first major championship today at the US Open at Pebble Beach at the age of 35. He wound up finishing at -13, three strokes ahead of Brooks Koepka, and finished up the tournament in style with a birdie butt to seal the victory on the 18th hole.\n\nCongrats to Woodland, who by many accounts is a very popular player amongst his colleagues on the PGA Tour.","author":"Ryan Glasspiegel","datePublished":"2019/06/16","authorLink":"https://thebiglead.com/author/ryan-glasspiegel/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/gettyimages-1156361191.jpg","imgName":"gettyimages-1156361191"},{"articleLink":"https://thebiglead.com/2019/06/16/brooks-koepka-girlfriend-jena-sims-instagram/","title":"Brooks Koepka's Girlfriend Jena Sims is Enjoying Herself at The U.S. Open","content":"Brooks Koepka is once again close to taking him a major championship, as he’s battling with Gary Woodland atop the leaderboard at the U.S. Open this weekend. Koepka’s girlfriend Jena Sims also seems to be enjoying her time at Pebble Beach.\n\nSims has been active on Instagram this week, showing off the fun she’s having at the U.S. Open. Check it out:\n\nKoepka and Sims have been together for more than a year and she’s shown off their relationship on Instagram often:\n\nSome more fantastic Instagram work from Sims is below and on the next few pages:\n\n1 2 3 4 …5","author":"Ryan Phillips","datePublished":"2019/06/16","authorLink":"https://thebiglead.com/author/ryan-phillips/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/jena-sims.jpg","imgName":"jena-sims"},{"articleLink":"https://thebiglead.com/2019/06/16/gary-woodland-wife-gabby-woodland/","title":"Meet Gary Woodland's Wife, Gabby Woodland","content":"Gary Woodland is in the hunt for his first major title at the U.S. Open this weekend. The 35-year-old Kansas native has won five professional titles and finished tied for sixth at the 2018 PGA Championship. And, as with most golfers, he has a lovely wife.\n\nWoodland and his wife Gabby Woodland have been married since 2015 and he’s clearly a very happy family man.\n\nCheck out some shots of Woodland and his wife below and on the next page.\n\n1 2","author":"Ryan Phillips","datePublished":"2019/06/16","authorLink":"https://thebiglead.com/author/ryan-phillips/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/gabby-woodland.jpg","imgName":"gabby-woodland"},{"articleLink":"https://thebiglead.com/2019/06/16/video-bronny-james-first-aau-dunk/","title":"Video: Bronny James Has First Dunk in AAU Game","content":"LeBron James Jr. has had dunks in middle school games and practice before, but over the weekend he had his first dunk in AAU game. The dunk, which occurs shortly after the 1:30 mark in the video above, happened at the Balling at the Beach event in Florida.\n\nIt was an eventful weekend for Bronny — he also hit a game-winner in a game earlier this weekend.\n\nWe’re going to start hearing more and more about Bronny going forward, as he and Dwyane Wade’s son are slated to be high school teammates in the Los Angeles area this upcoming season:","author":"Ryan Glasspiegel","datePublished":"2019/06/16","authorLink":"https://thebiglead.com/author/ryan-glasspiegel/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/screen-shot-2019-06-16-at-7.21.37-pm-e1560731546601.png","imgName":"screen-shot-2019-06-16-at-7.21.37-pm-e1560731546601"},{"articleLink":"https://thebiglead.com/2019/06/16/heres-gary-woodland-getting-buckets/","title":"Here's Gary Woodland Getting Buckets","content":"Gary Woodland continues to the lead the U.S. Open as we head down the stretch. This would be the biggest win of the 35-year-old’s life, and it’d be extra special if he were able to outduel Brooks Koepka for the title.\n\nThe Topeka native grew up dreaming of playing basketball for Kansas and had to settle for playing against the Jayhawks while a member of Washburn University, where he averaged six points in one year of play.\n\nHe then went to Kansas to play golf, which proved a wise choice.\n\nWoodland can still shoot it, though, as he proved in this Golf Channel segment.\n\nLittle pro tip for all the recreational ballers out there: any guy in his 30s who shows up to the run wearing a long-sleeved shirt is going to present a matchup problem. It’s a confident move only done by players who are going to play suffocating defense and knock down open jumpers.","author":"Kyle Koster","datePublished":"2019/06/16","authorLink":"https://thebiglead.com/author/koster/","imgLink":"https://usatthebiglead.files.wordpress.com/2019/06/gettyimages-1156349254.jpg","imgName":"gettyimages-1156349254"}]